
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	
	Макет = Документы.Договор.ПолучитьМакет("Печать");
	ОбластьДокумент = Макет.ПолучитьОбласть("Договор"); 
	ТабДок.АвтоМасштаб = 100;
	ТабДок.Очистить();

	ОбластьДокумент.Параметры.НомерДоговора 		= Ссылка[0].Номер;
	ОбластьДокумент.Параметры.Дата 					= Ссылка[0].Дата;
	ОбластьДокумент.Параметры.СуммаДоговора 		= Ссылка[0].Цена;
	ОбластьДокумент.Параметры.СуммаДоговораПрописью	= ЧислоПрописью(Ссылка[0].Цена,"Л = ru_RU; ДП = Истина","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	ОбластьДокумент.Параметры.ФИОПредставителя 		= Ссылка[0].Представитель;
	ОбластьДокумент.Параметры.ФИОПредставителя2 	= Ссылка[0].Представитель;
	ОбластьДокумент.Параметры.ДатаРождения 			= Ссылка[0].Представитель.ДатаРождения;
	ОбластьДокумент.Параметры.СерияПаспорта 		= Ссылка[0].Представитель.Серия;
	ОбластьДокумент.Параметры.НомерПаспорта 		= Ссылка[0].Представитель.Номер;
	ОбластьДокумент.Параметры.КемВыдан 				= Ссылка[0].Представитель.КемВыдан;
	ОбластьДокумент.Параметры.ДатаВыдачи 			= Ссылка[0].Представитель.ДатаВыдачи;
	ОбластьДокумент.Параметры.Телефон 				= Ссылка[0].Представитель.Телефон;
	ОбластьДокумент.Параметры.ФИОПредставителя3 	= Ссылка[0].Представитель;
	
	ТабДок.Вывести(ОбластьДокумент);
	
КонецПроцедуры
