
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Начисления.Записывать = Истина;
	Для Каждого ТекСтрокаЗП Из ЗП Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ВидРасчета;
		Движение.ПериодРегистрации = ДатаНачалаПериода;
		Движение.БазовыйПериодНачало = ДатаНачалаПериода;
		Движение.БазовыйПериодКонец = ДатаНачалаПериода;
		Движение.Сотрудник = ТекСтрокаЗП.Сотрудник;
		Движение.Результат = ТекСтрокаЗП.Начислено;
		Движение.ОтработаноДней = ТекСтрокаЗП.ФактическиОтработано;
		Движение.РезультатФСС = ТекСтрокаЗП.НДФЛ;
	КонецЦикла;

КонецПроцедуры
