Функция Стоимость(АктуальнаяДата, ЭлементПрайсЛиста) Экспорт
	
	Отбор = Новый Структура("ПрайсЛист", ЭлементПрайсЛиста);
	
	ЗначенияРесурсов = РегистрыСведений.Стоимость.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Возврат ЗначенияРесурсов.Стоимость;

КонецФункции

Функция Оклад(АктуальнаяДата, ЭлементСотрудников) Экспорт
	
	Отбор = Новый Структура("Сотрудник", ЭлементСотрудников);
	
	ЗначенияРесурсов = РегистрыСведений.Оклады.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Возврат ЗначенияРесурсов.Оклад;

КонецФункции
