

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатаОкончания = Дата + Длительность * 60;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ИсторияРасписания
	Движения.ИсторияРасписания.Записывать = Истина;
	Движение = Движения.ИсторияРасписания.Добавить();
	Движение.Период = Дата;
	Движение.Платформа = Платформа;
	Движение.Группа = Группа;
	Движение.Сотрудник = Преподаватель;
	Движение.Курс = Курс;
	Движение.НомерZoom = НомерZoom;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
