
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Оплата Приход
	Движения.Оплата.Записывать = Истина;
	Движение = Движения.Оплата.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Платформа = Платформа;
	Движение.Клиент = Клиент;
	Движение.ДатаОплаты = ДатаОплаты;
	Движение.Месяц = Месяц;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
